### <font color = 'red'> Class 13

#### Pandas

##### Panda Series

In [4]:
import pandas as pd

In [5]:
data = pd.Series([0.25,0.5,0.75,1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [6]:
type(data)

pandas.core.series.Series

In [7]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [8]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
data[2]

0.75

In [10]:
data = pd.Series([0.25,0.5,0.75,1.0],index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [11]:
data['c']

0.75

In [12]:
data[2]

C:\Users\user\AppData\Local\Temp\ipykernel_1988\1082122490.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  data[2]

0.75

In [13]:
population_dict = {'California':38,
                   'Texas':26,
                   'New York':20,
                   'Florida':19,
                   'Illinois':13
}

In [14]:
population = pd.Series(population_dict)
population

California    38
Texas         26
New York      20
Florida       19
Illinois      13
dtype: int64

In [15]:
population['Illinois']

13

In [16]:
population[0:2]

California    38
Texas         26
dtype: int64

In [17]:
population.iloc[0]

38

In [18]:
population['California':'New York']

California    38
Texas         26
New York      20
dtype: int64

In [19]:
pd.Series(7,index=[10,20,30,40])

10    7
20    7
30    7
40    7
dtype: int64

In [20]:
pd.Series({2:'a',5:'b',3:'c'},index=[3,2])

3    c
2    a
dtype: object

##### Panda Dataframe

In [22]:
area = pd.Series({
            'California':423,
            'Texas': 695,
            'New York': 141,
            'Florida': 170,
            'Illinois': 150
})
area

California    423
Texas         695
New York      141
Florida       170
Illinois      150
dtype: int64

In [23]:
states = pd.DataFrame({'Population' : population,
                        'Area' : area
})
states

            Population  Area
California          38   423
Texas               26   695
New York            20   141
Florida             19   170
Illinois            13   150

In [24]:
type(states)

pandas.core.frame.DataFrame

In [25]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [26]:
states.columns

Index(['Population', 'Area'], dtype='object')

In [27]:
data = [{'a':i,'b':2+i} for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  2
1  1  3
2  2  4

#### Indexing: iloc is implicit loc is explicit

In [29]:
data = pd.Series(['x','y','z'],index=[1,3,5])
data

1    x
3    y
5    z
dtype: object

In [30]:
data.loc[1]

'x'

In [31]:
data.loc[1:3]

1    x
3    y
dtype: object

In [32]:
data.iloc[1]

'y'

In [33]:
states

            Population  Area
California          38   423
Texas               26   695
New York            20   141
Florida             19   170
Illinois            13   150

In [34]:
data = pd.DataFrame({'area':area,'population':population})
data

            area  population
California   423          38
Texas        695          26
New York     141          20
Florida      170          19
Illinois     150          13

In [35]:
data['area']

California    423
Texas         695
New York      141
Florida       170
Illinois      150
Name: area, dtype: int64

In [36]:
data.area

California    423
Texas         695
New York      141
Florida       170
Illinois      150
Name: area, dtype: int64

In [37]:
data['population'] is data.population

True

In [38]:
data['density'] = data['population'] / data['area']
data

            area  population   density
California   423          38  0.089835
Texas        695          26  0.037410
New York     141          20  0.141844
Florida      170          19  0.111765
Illinois     150          13  0.086667

In [39]:
data.values

array([[4.23000000e+02, 3.80000000e+01, 8.98345154e-02],
       [6.95000000e+02, 2.60000000e+01, 3.74100719e-02],
       [1.41000000e+02, 2.00000000e+01, 1.41843972e-01],
       [1.70000000e+02, 1.90000000e+01, 1.11764706e-01],
       [1.50000000e+02, 1.30000000e+01, 8.66666667e-02]])

In [40]:
data.T

            California      Texas    New York     Florida    Illinois
area        423.000000  695.00000  141.000000  170.000000  150.000000
population   38.000000   26.00000   20.000000   19.000000   13.000000
density       0.089835    0.03741    0.141844    0.111765    0.086667

In [41]:
data.values[0]

array([4.23000000e+02, 3.80000000e+01, 8.98345154e-02])

In [42]:
data.iloc[:3,:2]

            area  population
California   423          38
Texas        695          26
New York     141          20

In [43]:
data.loc[:'New York',:'population']

            area  population
California   423          38
Texas        695          26
New York     141          20

##### in the loc indexer we can combine masking and fancy indexing

In [45]:
data.loc[data.density > 0.1,['population','density']]

          population   density
New York          20  0.141844
Florida           19  0.111765